Repository: ndaleksey/RolesConfigurator
Catalog: RolePermissionsConfigurator/Properties/Resources.*.resx
Languages: fr

# AbonentNumber
source: Номер абонента
fr: Numéro de abonné

# Accounts
source: Пользователи
fr: Les comptes

# Add
source: Добавить
fr: Ajouter

# ApplicationName
source: Конфигуратор задач оболочки приложений
fr: Shell tâches d'application du configurateur

# Attachment
source: Принадлежность
fr: Attachement

# Cancel
source: Отмена
fr: Annuler

# ClusterInitializationException
source: Ошибка инициализации кластера подразделения
fr: Erreur d'initialisation de cluster unité

# ClusterNumber
source: Номер кластера
fr: Numéro de grappe

# Code
source: Код
fr: Code

# Delete
source: Удалить
fr: Effacer

# DeleteRoleAcquirement
source: Вы действительно хотите удалить роль
fr: Êtes-vous sûr de vouloir supprimer le rôle

# DeselectAll
source: Снять выделение
fr: Tout déselectionner

# Edit
source: Изменить
fr: Modifier

# Grouping
source: Группировка
fr: Regroupement

# Inferior
source: Нижестоящий
fr: Inférieur

# Interacting
source: Взаимодействующий
fr: Interaction

# Login
source: Логин
fr: S'identifier

# ModifyRole
source: Изменение роли
fr: Modifier rôle

# Name
source: Имя
fr: Prénom

# Number
source: Номер
fr: Nombre

# Permission
source: Разрешение
fr: Autorisation

# PluginsSettings
source: Настройки модулей
fr: Paramètres des plugins

# PluginsStartup
source: Настройка запуска модулей
fr: Mise en route des plugins

# RoleAddition
source: Добавление роли
fr: Addition de rôle

# RoleDeleting
source: Удаление роли
fr: Suppression de rôle

# RoleModification
source: Редактирование роли
fr: Modification du rôle

# RoleName
source: Назначение АРМ
fr: La fonction

# RoleNameAndNumberUniqueRequirement
source: Номер или имя роли должны быть уникальными
fr: Numéro ou un nom de rôle doit être unique

# RoleNotExistsException
source: Данный пользователь вошел под несуществующей ролью. Дальнейшая работа программы невозможна
fr: Cet utilisateur est enregistré sous un rôle inexistant. Programme de travail futur ne peut pas être

# SelectAll
source: Выделить всё
fr: Tout sélectionner

# StartupPermission
source: Разрешение на запуск
fr: Autorisation de démarrage

# Subordination
source: Подчиненность
fr: Subordination

# SubsystemsSettings
source: Настройка подсистем
fr: Paramètres du sous-système

# Summary
source: Описание
fr: Résumé

# Superior
source: Вышестоящий
fr: Supérieur

# Value
source: Значение
fr: Valeur
